package leetcode.editor.cn;

// leetcode 数组相关 m 36 有效的数独
// 请你判断一个 9x9 的数独是否有效。只需要 根据以下规则 ，验证已经填入的数字是否有效即可。
//
// 
// 数字 1-9 在每一行只能出现一次。 
// 数字 1-9 在每一列只能出现一次。 
// 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图） 
// 
//
// 数独部分空格内已填入了数字，空白格用 '.' 表示。 
//
// 注意： 
//
// 
// 一个有效的数独（部分已被填充）不一定是可解的。 
// 只需要根据以上规则，验证已经填入的数字是否有效即可。 
// 
//
// 
//
// 示例 1： 
//
// 
//输入：board = 
//[["5","3",".",".","7",".",".",".","."]
//,["6",".",".","1","9","5",".",".","."]
//,[".","9","8",".",".",".",".","6","."]
//,["8",".",".",".","6",".",".",".","3"]
//,["4",".",".","8",".","3",".",".","1"]
//,["7",".",".",".","2",".",".",".","6"]
//,[".","6",".",".",".",".","2","8","."]
//,[".",".",".","4","1","9",".",".","5"]
//,[".",".",".",".","8",".",".","7","9"]]
//输出：true
// 
//
// 示例 2： 
//
// 
//输入：board = 
//[["8","3",".",".","7",".",".",".","."]
//,["6",".",".","1","9","5",".",".","."]
//,[".","9","8",".",".",".",".","6","."]
//,["8",".",".",".","6",".",".",".","3"]
//,["4",".",".","8",".","3",".",".","1"]
//,["7",".",".",".","2",".",".",".","6"]
//,[".","6",".",".",".",".","2","8","."]
//,[".",".",".","4","1","9",".",".","5"]
//,[".",".",".",".","8",".",".","7","9"]]
//输出：false
//解释：除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。 但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无
//效的。 
//
// 
//
// 提示： 
//
// 
// board.length == 9 
// board[i].length == 9 
// board[i][j] 是一位数字或者 '.' 
// 
// Related Topics 数组 哈希表 矩阵 👍 575 👎 0

import java.util.HashMap;
import java.util.Map;

public class ValidSudoku{
    public static void main(String[] args) {
        Solution solution = new ValidSudoku().new Solution();
    }

    /**
     * 1-9 每一行、每一列只能出现一次
     * 1-9在每个3*3的区域内只能出现一次
     * 用3个Map分别存储行列3*3的
     * 3*3的区域  row/3*3 + line/3
     * 1,1 0
     * 1,9 3
     * 8,3 7
     * 8 2 6
     * 7 2 6
     */
//leetcode submit region begin(Prohibit modification and deletion)
class Solution {
    public boolean isValidSudoku(char[][] board) {
        Map<Integer, Integer>[] row = new HashMap[9];
        Map<Integer, Integer>[] line = new HashMap[9];
        Map<Integer, Integer>[] box = new HashMap[9];
        for (int i = 0; i < row.length; i++) {
            row[i] = new HashMap<>();
            line[i] = new HashMap<>();
            box[i] = new HashMap<>();
        }

        for (int i = 0; i < board.length; i++) {
            for (int j = 0; j < board[0].length; j++) {
                int temp = board[i][j];
                int boxId = i/3*3 + j/3;
                if('.' == board[i][j]){
                    continue;
                }
                if(row[i].containsKey(temp) || line[j].containsKey(temp) || box[boxId].containsKey(temp)){
                    return false;
                }else{
                    row[i].put(temp, 1);
                    line[j].put(temp, 1);
                    box[boxId].put(temp, 1);
                }
            }
        }
        return true;
    }
}
//leetcode submit region end(Prohibit modification and deletion)

}